Процедура ОтправитьСообщениеВТелеграмЧат(ТекстСообщения) Экспорт
	
	Соединение = Новый HTTPСоединение("api.telegram.org",,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Запрос = Новый HTTPЗапрос("/bot" + Константы.ВКМ_ТокенТелеграм.Получить() + "/sendMessage", Заголовки);
	Поля = Новый Структура;
	Поля.Вставить("chat_id", Константы.ВКМ_ЧатИДТелеграм.Получить());
	Поля.Вставить("text", ТекстСообщения);
	Запрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(Поля));
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Если Не Ответ.КодСостояния = 200 Тогда
		ЗаписьЖурналаРегистрации(Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
		
КонецПроцедуры