#Область СлужебныеПроцедурыИФункции

Функция ОтправитьСообщениеВТелеграмЧат(ТекстСообщения)
	
	Соединение = Новый HTTPСоединение("api.telegram.org",,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Запрос = Новый HTTPЗапрос("/bot" + Константы.ВКМ_ТокенТелеграм.Получить() + "/sendMessage", Заголовки);
	Поля = Новый Структура;
	Поля.Вставить("chat_id", Константы.ВКМ_ЧатИДТелеграм.Получить());
	Поля.Вставить("text", ТекстСообщения);
	Запрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(Поля));
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Истина;
	Иначе
		ЗаписьЖурналаРегистрации(Ответ.ПолучитьТелоКакСтроку());
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

Процедура ОтправитьУведомленияВТелеграм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ОтправитьСообщениеВТелеграмЧат(Выборка.ТекстСообщения) Тогда
			Выборка.Ссылка.ПолучитьОбъект().Удалить();	
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти























