Функция РеализацииЗаПериод(Знач Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Владелец
		|ПОМЕСТИТЬ вт_Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И &Период
		|		МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт_Документы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = МЕСЯЦ(&Период)
		|	И ГОД(РеализацияТоваровУслуг.Дата) = ГОД(&Период)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Договоры.Ссылка КАК Договор,
		|	вт_Договоры.Владелец КАК Контрагент,
		|	вт_Договоры.Организация КАК Организация,
		|	вт_Документы.Ссылка КАК ДокументРеализация
		|ИЗ
		|	вт_Договоры КАК вт_Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Документы КАК вт_Документы
		|		ПО вт_Договоры.Ссылка = вт_Документы.Договор.Ссылка";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДокументыРеализации = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ДокументРеализация) = ЗначениеЗаполнено(Неопределено) Тогда
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Иначе
			ДокументРеализация = Выборка.ДокументРеализация.ПолучитьОбъект();
		КонецЕсли;
		ДокументРеализация.Дата = КонецМесяца(Период);
		ДокументРеализация.Договор = Выборка.Договор;
		ДокументРеализация.Контрагент = Выборка.Контрагент;
		ДокументРеализация.Организация = Выборка.Организация;
		ДокументРеализация.Ответственный = Пользователи.ТекущийПользователь();
		ДокументРеализация.ВыполнитьАвтозаполнение();
		ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
		
		СтрокаТаблицы = Новый Структура;
		СтрокаТаблицы.Вставить("Договор", Выборка.Договор);
		СтрокаТаблицы.Вставить("ДокументРеализации", ДокументРеализация.Ссылка);
		ДокументыРеализации.Добавить(СтрокаТаблицы);
		
	КонецЦикла;
	
	Возврат ДокументыРеализации;
	
КонецФункции