#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Обработчикисобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	
	Для Каждого ТекСтрокаСотрудникиСПремией Из СотрудникиСПремией Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСотрудникиСПремией.Сотрудник;
		Движение.Результат = ТекСтрокаСотрудникиСПремией.СуммаПремии;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Для Каждого Строка Из Движения.ВКМ_ДополнительныеНачисления Цикл
		ВКМ_ПроведениеРасчетов.ДобавитьУдержание(Строка, Движения.ВКМ_Удержания);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли