
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Данные = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	ЗаполнитьДиаграмму(Данные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграмму(Данные)
	ДГ.Обновление = Ложь;
	ДГ.Очистить();
	
	Серия = ДГ.Серии.Добавить();
	Серия.Текст = "Отпуска";
	Для Каждого Строка Из Данные Цикл
		Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник.Наименование;
		Значение = ДГ.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;
	
	ДГ.Обновление = Истина;
КонецПроцедуры

#КонецОбласти
